notForRelease/notes/transitivity.org


** Resolution steps for transitivity


- Introduce also reachability predicate $reach(x)$
- Have sets ${\cal R}$ and ${\cal S}$ 
- initially, ${\cal R} is equal to $\{reach(s)\}$, where $s$ is the
  initial state
- every rule with conclusion $\reach (M)$ is added to ${\cal R}$,
  every rule with conclusion $\seq(x, y)$ is added to ${\cal S}$
- Add transitivity rule $seq(x, y) \wedge seq (y, z) \supset seq(y,
  z)$ 
- Add also rules $reach(x) \wedge seq(x, y) \supset reach(y)$ and
  $reach(x) \supset seq(x, x)$.
- All three rules  are applied in stages:
  * Let $R = H \supset C$ be the rule obtained by composition
    with this particular rule.
  * Let ${\cal C}$ be the set of rules obtained by
    composing $R$ with all rules in ${\cal R}$.
  * Let ${\cal C}'$ be the set of all rules obtained by composing all
    rule in ${\cal C}$ with all rules in ${\cal S}$ if the original
    rule has seq(x, y)$ as a hypothesis.
  * The set ${\cal C}'$ is the result of the composition with the
    transitivity rule.

** Modification to translation

To be done.

